Revit 2026 API

# AnalysisDisplayColorEntry(Color) Constructor

---

Constructs a color entry with no value assigned.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalysisDisplayColorEntry(
	Color color
)
```
```vb
Public Sub New (
	color As Color
)
```
```cpp
public:
AnalysisDisplayColorEntry(
	Color^ color
)
```
```fsharp
new :
        color : Color -> AnalysisDisplayColorEntry
```

#### Parameters

color Color
     Color assigned to the entry.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalysisDisplayColorEntry Class

AnalysisDisplayColorEntry Overload

Autodesk.Revit.DB.Analysis Namespace